/*!
****************************************************************************************************
* 文件名称：main.c
* 功能简介：该文件是应用程序入口程序的实现源文件
* 文件作者：HQHP
* 创建日期：2023-01-11
* 版权声明：All Rights Reserved.
****************************************************************************************************
*/
#include <hqhp/drvmanager.h>
#include <hqhp/devmanager.h>
#include "drvmanager/drvmanager.h"
#include "stm32f4xx.h"
#include "sysmanager/sysmanager.h"
#include "commanager/commanager.h"
#include <string.h>
#include "hqhp/pid.h"


/*!
****************************************************************************************************
* 常量定义
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 类型定义
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 全局变量
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 本地声明
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 接口函数
****************************************************************************************************
*/
/*!
****************************************************************************************************
* 功能描述：
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
int main(int argc, const char* argv[])
{
	bool isOn;
	struct _TIMER tmr;

	// 加上断言可以确保避免一些错误
	STATIC_ASSERT(MAJOR_ERR_TYPE_LAST <= ERR_TYPE_MAX_NUMS);

	DRVMGR_Init();
	DEVMGR_Init();
	COMMGR_Init();
	SYSMGR_Init();

	isOn = false;
	DRVMGR_TimerStart(&tmr, RUN_LED_ON_TIME);

	while (1) {
		DRVMGR_Handle();
		DEVMGR_Handle();
		COMMGR_Handle();
		SYSMGR_Handle();

		if (isOn) {
			if (DRVMGR_TimerIsExpiration(&tmr)) {
				isOn = false;
				DRVMGR_TimerStart(&tmr, 1000 - RUN_LED_ON_TIME);
				DRVMGR_LEDTurnOff();
			}
		} else {
			if (DRVMGR_TimerIsExpiration(&tmr)) {
				isOn = true;
				DRVMGR_TimerStart(&tmr, RUN_LED_ON_TIME);
				DRVMGR_LEDTurnOn();
			}
		}
		DRVMGR_CPUFeedWDG();
	}

	return 0;
}
