/*!
****************************************************************************************************
* 文件名称：pid.c
* 功能简介：该文件是PID算法模块的实现源文件
* 文件作者：LUDONGDONG
* 创建日期：2025-03-16
* 版权声明：All Rights Reserved.
****************************************************************************************************
*/
#include <math.h>
#include "hqhp/pid.h"

/*!
****************************************************************************************************
* 常量定义
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 类型定义
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 全局变量
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 本地声明
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 接口函数
****************************************************************************************************
*/
/*!
****************************************************************************************************
* 功能描述：该方法用于初始化PID控制器
* 注意事项：在调用该模块其他API前，必须先调用该模块
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void PIDInit(struct _PID* d)
{
	d->Err[0]	   = 0;
	d->Err[1]	   = 0;
	d->Err[2]	   = 0;
	d->Sum		   = 0;
	d->Out		   = 0;
	d->Para.KP	   = 0;
	d->Para.KI	   = 0;
	d->Para.KD	   = 0;
	d->Para.SumMax = 0;
	d->Para.ErrMax = 0;
	d->Para.OutMax = 0;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于计算PID控制器输出
* 注意事项：该方法必须周期调用
* 输入参数：fbVal -- 反馈值
* 输出参数：NA
* 返回参数：PID控制器新输出值
****************************************************************************************************
*/
float PIDCompute(struct _PID* d, float fbVal)
{
	struct {
		float p;
		float i;
		float d;
	} o;
	float			  err;
	struct _PID_PARA* para = &d->Para;

	// 计算误差
	err = d->Sp - fbVal;
//	if ((err > -0.1) && (err < 0)) {
//		err = 0;
//	}

	// 限幅控制
	if (err > para->ErrMax) {
		err = para->ErrMax;
	} else if (err < (0 - para->ErrMax)) {
		err = 0 - para->ErrMax;
	}

	// 更新误差
	d->Err[2] = d->Err[1]; // 更新T2时刻误差
	d->Err[1] = d->Err[0]; // 更新T1时刻误差
	d->Err[0] = err;	   // 更新T0时刻误差

	// 计算比例输出
	o.p = d->Err[0] * para->KP;

	// 更新积分
	d->Sum += d->Err[0];

	// 积分限幅控制，抗饱和
	if (d->Sum > para->SumMax) {
		d->Sum = para->SumMax;
	} else if (d->Sum < (0 - para->SumMax)) {
		d->Sum = 0 - para->SumMax;
	}

	// 计算积分输出
	o.i = d->Sum * para->KI;

	// 计算微分输出
	o.d = (d->Err[0] - d->Err[1]) * para->KD;

	// 计算输出
	d->Out = o.p + o.i + o.d;
	// 输出限幅控制
	if (d->Out > para->OutMax) {
		d->Out = para->OutMax;
	} else if (d->Out < (0 - para->OutMax)) {
		d->Out = 0 - para->OutMax;
	}
    
	return d->Out;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于计算PID控制器（增量式）输出
* 注意事项：该方法必须周期调用
* 输入参数：fbVal -- 反馈值
* 输出参数：NA
* 返回参数：PID控制器新输出值
****************************************************************************************************
*/
float PIDComputeSpdCtl(struct _PID* d, float fbVal)
{
	struct {
		float p;
		float i;
		float d;
	} o;
	float			  err;
	struct _PID_PARA* para = &d->Para;

	// 计算误差
	err = d->Sp - fbVal;

	// 限幅控制
	if (err > para->ErrMax) {
		err = para->ErrMax;
	} else if (err < (0 - para->ErrMax)) {
		err = 0 - para->ErrMax;
	}

	// 更新误差
	d->Err[2] = d->Err[1]; // 更新T2时刻误差
	d->Err[1] = d->Err[0]; // 更新T1时刻误差
	d->Err[0] = err;	   // 更新T0时刻误差

	// 计算比例输出
	o.p = (d->Err[0] - d->Err[1]) * para->KP;

	// 计算积分输出
	o.i = d->Err[0] * para->KI;

	// 计算微分输出
	o.d = (d->Err[0] - 2 * d->Err[1] + d->Err[2]) * para->KD;

	// 计算输出
	d->Out += (o.p + o.i + o.d);
	// 输出限幅控制
	if (d->Out > (d->Sp + para->SumMax)) {
		d->Out = d->Sp + para->SumMax;
	}

	if (d->Out > para->OutMax) {
		d->Out = para->OutMax;
	} else if (d->Out < 0) {
		d->Out = 0;
	}

	return d->Out;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于计算PID控制器输出
* 注意事项：该方法必须周期调用
* 输入参数：fbVal -- 反馈值
* 输出参数：NA
* 返回参数：PID控制器新输出值
****************************************************************************************************
*/
float PIDComputeS(struct _PID* d, float fbVal)
{
	struct {
		float p;
		float i;
		float d;
	} o;
	float			  err;
	struct _PID_PARA* para = &d->Para;

	// 计算误差
	err = d->Sp - fbVal;

	// 限幅控制
	if (err > para->ErrMax) {
		err = para->ErrMax;
	} else if (err < (0 - para->ErrMax)) {
		err = 0 - para->ErrMax;
	}

	// 更新误差
	d->Err[2] = d->Err[1]; // 更新T2时刻误差
	d->Err[1] = d->Err[0]; // 更新T1时刻误差
	d->Err[0] = err;	   // 更新T0时刻误差

	// 计算比例输出
	o.p = d->Err[0] * para->KP;

	// 更新积分
	d->Sum += d->Err[0];
	// 积分限幅控制，抗饱和
	if (d->Sum > para->SumMax) {
		d->Sum = para->SumMax;
	} else if (d->Sum < (0 - para->SumMax)) {
		d->Sum = 0 - para->SumMax;
	}

	// 计算积分输出
	o.i = d->Sum * para->KI;

	// 计算微分输出
	o.d = (d->Err[0] - d->Err[1]) * para->KD;

	// 计算输出
	d->Out = o.p + o.i + o.d;
	// 输出限幅控制
	if (d->Out > para->OutMax) {
		d->Out = para->OutMax;
	} else if (d->Out < (0 - para->OutMax)) {
		d->Out = 0 - para->OutMax;
	}
    
	return d->Out;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取PID控制器的设定值
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：PID控制器设定值
****************************************************************************************************
*/
float PIDGetSP(struct _PID* d)
{
	return d->Sp;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取PID控制器的设定值
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：PID控制器设定值
****************************************************************************************************
*/
float PIDGetErr(struct _PID* d)
{
	return d->Err[0];
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取PID控制器的输出值
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：PID控制器输出值
****************************************************************************************************
*/
float PIDGetOutput(struct _PID* d)
{
	return d->Out;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取PID控制器的比例系数
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：PID控制器比例系数
****************************************************************************************************
*/
float PIDGetKP(struct _PID* d)
{
	return d->Para.KP;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取PID控制器的积分系数
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：PID控制器积分系数
****************************************************************************************************
*/
float PIDGetKI(struct _PID* d)
{
	return d->Para.KI;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取PID控制器的微分系数
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：PID控制器微分系数
****************************************************************************************************
*/
float PIDGetKD(struct _PID* d)
{
	return d->Para.KD;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取PID控制器的积分求和最大值
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：PID控制器积分求和最大值
****************************************************************************************************
*/
float PIDGetSumMax(struct _PID* d)
{
	return d->Para.SumMax;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取PID控制器的误差最大值
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：PID控制器误差最大值
****************************************************************************************************
*/
float PIDGetErrMax(struct _PID* d)
{
	return d->Para.ErrMax;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取PID控制器的输出最大值
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：PID控制器输出最大值
****************************************************************************************************
*/
float PIDGetOutMax(struct _PID* d)
{
	return d->Para.OutMax;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于设置PID控制器的设定值
* 注意事项：NA
* 输入参数：sp -- 设定值
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void PIDSetSP(struct _PID* d, float sp)
{
	d->Sp = sp;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于设置PID控制器的比例系数
* 注意事项：NA
* 输入参数：kp -- 比例系数
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void PIDSetKP(struct _PID* d, float kp)
{
	d->Para.KP = kp;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于设置PID控制器的积分系数
* 注意事项：NA
* 输入参数：ki -- 积分系数
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void PIDSetKI(struct _PID* d, float ki)
{
	d->Para.KI = ki;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于设置PID控制器的微分系数
* 注意事项：NA
* 输入参数：kd -- 微分系数
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void PIDSetKD(struct _PID* d, float kd)
{
	d->Para.KD = kd;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于设置PID控制器的积分求和最大值
* 注意事项：NA
* 输入参数：max -- 积分求和最大值
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void PIDSetSumMax(struct _PID* d, float max)
{
	d->Para.SumMax = max;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于设置PID控制器的误差最大值
* 注意事项：NA
* 输入参数：max -- 误差最大值
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void PIDSetErrMax(struct _PID* d, float max)
{
	d->Para.ErrMax = max;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于设置PID控制器的输出最大值
* 注意事项：NA
* 输入参数：max -- 输出最大值
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void PIDSetOutMax(struct _PID *d, float max)
{
	d->Para.OutMax = max;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于设置PID控制器的输出值
* 注意事项：NA
* 输入参数：out -- 输出值
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void PIDSetOutput(struct _PID* d, float out)
{
	d->Out = out;
}

/*!
****************************************************************************************************
* 本地函数
****************************************************************************************************
*/
/*!
****************************************************************************************************
* 功能描述：该方法用于
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/

