/*!
****************************************************************************************************
* 文件名称：devmanager-pt206.c
* 功能简介：该文件是设备管理器PT206设备模块的实现源文件
* 文件作者：Haotian
* 创建日期：2020-09-17
* 版权声明：All Rights Reserved.
****************************************************************************************************
*/
#include <string.h>
#include <hqhp/defs.h>
#include <hqhp/errmanager.h>
#include <hqhp/drvmanager.h>
#include "stm32f4xx.h"
#include "devmanager.h"

/*!
****************************************************************************************************
* 常量定义
****************************************************************************************************
*/
#define ZERO_VOL		 (CONFIG_PS_ZERO_VOL_PT206) // 压力为零时输出电压值，单位mV
#define FULL_VOL		 (CONFIG_PS_FULL_VOL_PT206) // 压力满量程时输出电压值，单位mV
#define LOST_VOL		 (ZERO_VOL * 0.8f)			// 压力传感器未接时电压值，单位mV
#define CHECK_PERIOD	 (100)
#define OVER_TIMES_LIMIT (3 * (1000 / CHECK_PERIOD))

/*!
****************************************************************************************************
* 类型定义
****************************************************************************************************
*/
struct _PS_INFO {
	bool  IsLost;
	float Value;	// 压力值，单位MPa
	float VolValue; // 电压值，单位mV
};

struct _PS_MGR {
	struct _PS_INFO Info;
	struct _PS_PARA Para;
	uint8_t			OVPSCnt;	// 超压次数
	uint8_t			OVPSEnable; // 超压使能
	uint8_t			IsLimit;	//
	struct _TIMER	Tmr;		// 用于过压检测
};

/*!
****************************************************************************************************
* 全局变量
****************************************************************************************************
*/
static struct _PS_MGR gPS_MGR;

/*!
****************************************************************************************************
* 本地声明
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 接口函数
****************************************************************************************************
*/
/*!
****************************************************************************************************
* 功能描述：该方法用于初始化压力传感器设备模块
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DEVMGR_PT206Init(void)
{
	gPS_MGR.Info.IsLost	  = false;
	gPS_MGR.Info.Value	  = 0;
	gPS_MGR.Info.VolValue = 0;
	gPS_MGR.IsLimit		  = false;
	gPS_MGR.OVPSCnt		  = 0;

	// 启动过压检测定时器
	DRVMGR_TimerStart(&gPS_MGR.Tmr, CHECK_PERIOD);
}

/*!
****************************************************************************************************
* 功能描述：该方法用于处理压力传感器设备模块的周期事务
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DEVMGR_PT206Handle(void)
{
	if (DEVMGR_PT206IsLost()) {
		ERRMGR_MajorErrorSet(MAJOR_ERR_PS_LOST);
	} else {
		ERRMGR_MajorErrorClear(MAJOR_ERR_PS_LOST);
	}

	// 判断超压检测定时器是否到期
	if (DRVMGR_TimerIsExpiration(&gPS_MGR.Tmr)) {
		// 重启压力检测定时器
		DRVMGR_TimerStart(&gPS_MGR.Tmr, CHECK_PERIOD);
		// 过流检测使能的情况下检测压力是否过限
		if (DEVMGR_PT206InqValue() < gPS_MGR.Para.Limit) {
			gPS_MGR.OVPSCnt = 0;
			gPS_MGR.IsLimit = false;
		} else {
			gPS_MGR.OVPSCnt += 1;
			if (gPS_MGR.OVPSCnt > OVER_TIMES_LIMIT) {
				gPS_MGR.OVPSCnt = OVER_TIMES_LIMIT;
				gPS_MGR.IsLimit = true;
			}
		}
	}
}

/*!
****************************************************************************************************
* 功能描述：该方法用于判断压力传感器是否连接
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：如果为TRUE则说明压力传感器未连接
****************************************************************************************************
*/
bool DEVMGR_PT206IsLost(void)
{
	bool isLost = true;
#if 0
	if (DRVMGR_ADCGetValue(3) > LOST_VOL) {
		isLost = false;
	}
#endif
	return isLost;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取压力传感器是否过压
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：如果过压返回TRUE，否则返回FALSE
****************************************************************************************************
*/
bool DEVMGR_PT206IsLimit(void)
{
	return gPS_MGR.IsLimit;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取压力传感器的量程
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：量程，单位MPa
****************************************************************************************************
*/
float DEVMGR_PT206InqRange(void)
{
	return gPS_MGR.Para.Range;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取压力传感器的缩放系数
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：缩放系数，无量纲
****************************************************************************************************
*/
float DEVMGR_PT206InqRatio(void)
{
	return gPS_MGR.Para.Ratio;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取压力传感器的偏移参数
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：偏移参数，单位MPa
****************************************************************************************************
*/
float DEVMGR_PT206InqDelta(void)
{
	return gPS_MGR.Para.Delta;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取压力传感器的过压值
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：过压值，单位MPa
****************************************************************************************************
*/
float DEVMGR_PT206InqLimit(void)
{
	return gPS_MGR.Para.Limit;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于查询压力传感器的参数
* 注意事项：NA
* 输入参数：NA
* 输出参数：para -- 压力传感器参数
* 返回参数：ERROR_NONE -- 执行成功
*           ERROR_PARA_INVALID -- 参数无效
****************************************************************************************************
*/
int DEVMGR_PT206GetPara(struct _PS_PARA *para)
{
	if (!para) {
		return ERROR_PARA_INVALID;
	}

	memcpy(para, &gPS_MGR.Para, sizeof(*para));

	return ERROR_NONE;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于设置压力传感器的参数
* 注意事项：NA
* 输入参数：para -- 压力传感器参数
* 输出参数：NA
* 返回参数：ERROR_NONE -- 执行成功
*           ERROR_PARA_INVALID -- 参数无效
****************************************************************************************************
*/
int DEVMGR_PT206SetPara(const struct _PS_PARA *para)
{
	if (!para) {
		return ERROR_PARA_INVALID;
	}

	memcpy(&gPS_MGR.Para, para, sizeof(*para));

	return ERROR_NONE;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于获取压力传感器的压力值
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：压力值，单位MPa
****************************************************************************************************
*/
float DEVMGR_PT206InqValue(void)
{
	float pressure;
	float volValue;

	// 获取压力传感器通道采样电压
	volValue = DRVMGR_ADCGetValue(3);

	// 根据传感器类型进行电压-压力变换
	pressure = (volValue - ZERO_VOL) * gPS_MGR.Para.Range / (FULL_VOL - ZERO_VOL);
	pressure = pressure * gPS_MGR.Para.Ratio + gPS_MGR.Para.Delta;
	if (pressure < 0) {
		pressure = 0;
	} else if (pressure > gPS_MGR.Para.Range) {
		pressure = gPS_MGR.Para.Range;
	}

	gPS_MGR.Info.Value = pressure;
	gPS_MGR.Info.VolValue = volValue;

	return gPS_MGR.Info.Value;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于使能过压检测
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DEVMGR_PT206OVPSChkEnable(void)
{
	gPS_MGR.OVPSEnable = 1;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于失能过压检测
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DEVMGR_PT206OVPSChkDisable(void)
{
	gPS_MGR.OVPSEnable = 0;
}
