/*!
****************************************************************************************************
* 文件名称：drvmanager-timer.c
* 功能简介：该文件是驱动管理器定时器驱动模块的实现源文件
* 文件作者：HQHP
* 创建日期：2023-01-11
* 版权声明：All Rights Reserved.
****************************************************************************************************
*/
#include "drvmanager/drvmanager.h"
#include "stm32f4xx.h"

/*!
****************************************************************************************************
* 常量定义
****************************************************************************************************
*/
// 该宏来源于LINUX系统，回绕问题请参考相关解释
#define time_after(a, b) (((int32_t)(b) - (int32_t)(a)) < 0)

/*!
****************************************************************************************************
* 类型定义
****************************************************************************************************
*/
struct _TMR_MGR {
	uint32_t Ticks; // 滴答计数，每毫秒递增
};

/*!
****************************************************************************************************
* 全局变量
****************************************************************************************************
*/
static struct _TMR_MGR gTMRMGR;

/*!
****************************************************************************************************
* 本地声明
****************************************************************************************************
*/
static void DRVMGR_TimerUpdate(void);
static void DRVMGR_TimerHwInit(void);

/*!
****************************************************************************************************
* 接口函数
****************************************************************************************************
*/
/*!
****************************************************************************************************
* 功能描述：该方法用于初始化定时器驱动模块
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DRVMGR_TimerInit(void)
{
	gTMRMGR.Ticks = 0;

	DRVMGR_TimerHwInit();
}

/*!
****************************************************************************************************
* 功能描述：该方法是定时器驱动模块的周期服务函数
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DRVMGR_TimerHandle(void)
{
	/* NOTHING TO DO */
}

/*!
****************************************************************************************************
* 功能描述：该方法用于延时指定的微秒数
* 注意事项：NA
* 输入参数：us -- 期待循环等待的微秒数
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DRVMGR_TimerDelayUs(uint16_t us)
{
	SysTick->CTRL |= SysTick_CTRL_CLKSOURCE_Msk;
	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
	SysTick->CTRL &= ~SysTick_CTRL_TICKINT_Msk;
	SysTick->LOAD = (SystemCoreClock / 1000000) * us - 1;
	SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
	SysTick->VAL = 0;
	while ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0)
		;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于创建定时器
* 注意事项：NA
* 输入参数：tmr -- 定时器对象
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DRVMGR_TimerCreate(struct _TIMER* tmr)
{
	DRVMGR_TimerCancel(tmr);
}

/*!
****************************************************************************************************
* 功能描述：该方法用于启动定时器运行
* 注意事项：NA
* 输入参数：tmr      -- 定时器对象
*           interval -- 定时间隔，单位毫秒
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DRVMGR_TimerStart(struct _TIMER* tmr, int32_t interval)
{
	if (interval < 1) {
		return;
	}
	
	interval -= 1;
	tmr->Enable	  = 1;
	tmr->Interval = interval;
	tmr->DueTime  = gTMRMGR.Ticks + interval;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于取消定时器运行
* 注意事项：NA
* 输入参数：tmr -- 定时器对象
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void DRVMGR_TimerCancel(struct _TIMER* tmr)
{
	tmr->Enable	  = 0;
	tmr->Interval = 0;
	tmr->DueTime  = 0;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于判断定时器是否使能
* 注意事项：NA
* 输入参数：tmr -- 定时器对象
* 输出参数：NA
* 返回参数：如果定时器使能返回TRUE，否则返回FALSE
****************************************************************************************************
*/
bool DRVMGR_TimerIsEnable(struct _TIMER* tmr)
{
	if (tmr->Enable) {
		return true;
	}

	return false;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于判断定时器是否到期
* 注意事项：NA
* 输入参数：tmr -- 定时器对象
* 输出参数：NA
* 返回参数：如果定时器到期返回TRUE，否则返回FALSE
****************************************************************************************************
*/
bool DRVMGR_TimerIsExpiration(struct _TIMER* tmr)
{
	if (tmr->Enable) {
		if (time_after(gTMRMGR.Ticks, tmr->DueTime)) {
			return true;
		}
	}

	return false;
}

/*!
****************************************************************************************************
* 本地函数
****************************************************************************************************
*/
/*!
****************************************************************************************************
* 功能描述：该方法用于更新毫秒软定时器计数执行超时处理
* 注意事项：该方法应在硬件定时器中周期调用
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
static void DRVMGR_TimerUpdate(void)
{
	gTMRMGR.Ticks += 1;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于初始化定时器外设模块
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
static void DRVMGR_TimerHwInit(void)
{
	TIM_TimeBaseInitTypeDef timeBaseStructure;

	// 使能外设时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, DISABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

	// 配置时间参数：APB1时钟为系统时钟的1/4，定时频率为1Hz
	timeBaseStructure.TIM_Period		= SystemCoreClock / 2000 - 1;
	timeBaseStructure.TIM_Prescaler		= 1;
	timeBaseStructure.TIM_ClockDivision = 0;
	timeBaseStructure.TIM_CounterMode	= TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM2, &timeBaseStructure);

	// 使能超时中断
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
	NVIC_EnableIRQ(TIM2_IRQn);

	// 使能定时器
	TIM_Cmd(TIM2, ENABLE);
}

/*!
****************************************************************************************************
* 功能描述：该方法用于
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) == SET) {
		// 清除超时更新标志
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
		// 处理毫秒定时器事件
		DRVMGR_TimerUpdate();
	}
}
