/*!
****************************************************************************************************
* 文件名称：crc.h
* 功能简介：该文件是公共库CRC校验模块的接口头文件
* 文件作者：Haotian
* 创建日期：2020-09-30
* 版权声明：All Rights Reserved.
****************************************************************************************************
*/
#ifndef INCLUDE_HQHP_CRYPTO_CRC_H_
#define INCLUDE_HQHP_CRYPTO_CRC_H_

/*!
****************************************************************************************************
* 包含文件
****************************************************************************************************
*/
#include <hqhp/defs.h>
#ifdef __cplusplus
extern "C" {
#endif

/*!
****************************************************************************************************
* 常量定义
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 类型定义
****************************************************************************************************
*/
enum CRCType {
	CRC8,			   // POLY: 07 INIT: 0x00 XOR: 0x00 LSB
	CRC8_TIU,		   // POLY: 07 INIT: 0x00 XOR: 0x55 LSB
	CRC8_ROHC,		   // POLY: 07 INIT: 0xFF XOR: 0x00 LSB
	CRC8_MAXIM,		   // POLY: 31 INIT: 0x00 XOR: 0x00 LSB
	CRC16_IBM,		   // POLY: 8005 INIT: 0x0000 XOR: 0x0000 LSB
	CRC16_MAXIM,	   // POLY: 8005 INIT: 0x0000 XOR: 0xFFFF LSB
	CRC16_USB,		   // POLY: 8005 INIT: 0xFFFF XOR: 0xFFFF LSB
	CRC16_MODBUS,	   // POLY: 8005 INIT: 0xFFFF XOR: 0x0000 LSB
	CRC16_CCITT,	   // POLY: 1021 INIT: 0x0000 XOR: 0x0000 LSB
	CRC16_CCITT_FALSE, // POLY: 1021 INIT: 0xFFFF XOR: 0x0000 MSB
	CRC16_X25,		   // POLY: 1021 INIT: 0xFFFF XOR: 0xFFFF LSB
	CRC16_XMODEM,	   // POLY: 1021 INIT: 0x0000 XOR: 0x0000 MSB
	CRC16_DNP,		   // POLY: 3D65 INIT: 0x0000 XOR: 0xFFFF LSB
	CRC32,			   // POLY: 8005 INIT: 0x0000 XOR: 0x0000 LSB
	CRC32_MPEG2		   // POLY: 8005 INIT: 0x0000 XOR: 0x0000 LSB
};

/*!
****************************************************************************************************
* 全局变量
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 接口函数
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 内联函数
****************************************************************************************************
*/
uint32_t CRC_Compute(enum CRCType type, const uint8_t* data, int bytes);
uint32_t CRC_ComputePart(enum CRCType type, uint32_t initSeed, const uint8_t* data, int bytes);
uint32_t CRC_ComputeComplete(enum CRCType type, uint32_t initSeed);

#ifdef __cplusplus
}
#endif
#endif /* INCLUDE_HQHP_CRYPTO_CRC_H_ */
