/*!
****************************************************************************************************
* 文件名称：sysmanager-idle.c
* 功能简介：该文件是系统管理器空闲状态模块的实现源文件
* 文件作者：Haotian
* 创建日期：2020-09-17
* 版权声明：All Rights Reserved.
****************************************************************************************************
*/
#include <hqhp/drvmanager.h>
#include <hqhp/devmanager.h>
#include "sysmanager.h"

/*!
****************************************************************************************************
* 常量定义
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 类型定义
****************************************************************************************************
*/
struct _WORK_INFO {
	uint8_t State;
	bool	StopFlag;
	struct _TIMER Tmr;
};

/*!
****************************************************************************************************
* 全局变量
****************************************************************************************************
*/
static struct _WORK_INFO G_WRKMGR;

/*!
****************************************************************************************************
* 本地声明
****************************************************************************************************
*/
#define VFD_in_idle			 0x0233
#define VDF_IDLE_STOP_PERIOD 50 //空闲状态检查变频器是否停止

/*!
****************************************************************************************************
* 接口函数
****************************************************************************************************
*/
/*!
****************************************************************************************************
* 功能描述：该方法用于初始化空闲状态流程
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：如果初始化成功返回TRUE，否则返回FALSE
****************************************************************************************************
*/
bool SYSMGR_IdleInit(void)
{
	G_WRKMGR.State	  = WORK_INIT;
	G_WRKMGR.StopFlag = false;
	DRVMGR_TimerStart(&G_WRKMGR.Tmr, VDF_IDLE_STOP_PERIOD);
	
	return true;
}

/*!
****************************************************************************************************
* 功能描述：该方法用于判断空闲状态流程是否执行完毕
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：如果执行完毕返回TRUE，否则返回FALSE
****************************************************************************************************
*/
bool SYSMGR_IdleIsDone(void)
{
	return (G_WRKMGR.State == WORK_DONE);
}

/*!
****************************************************************************************************
* 功能描述：该方法用于处理空闲状态流程事务
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/
void SYSMGR_IdleHandle(void)
{
	switch (G_WRKMGR.State) {
		case WORK_DONE:
			break;

		case WORK_INIT:
			//进入看空闲状态查看泵是否已经关闭，如果未关闭则立即关闭泵。
			if (DRVMGR_TimerIsExpiration(&G_WRKMGR.Tmr)) {
				DRVMGR_TimerStart(&G_WRKMGR.Tmr, VDF_IDLE_STOP_PERIOD);
				if (!DEVMGR_VFDIsReady()) {
					DEVMGR_VFDStop();
					G_WRKMGR.StopFlag = true;
					break;
				}
				G_WRKMGR.State = WORK_DOING;
			}
			break;

		case WORK_DOING:
			//监测CAN总线上备机信号是否就绪
			if (COMMGR_CANGetBackupState() == 1) {
				SYSMGR_SetRunState(RUNSTATE_RUNNING);
			} else {
				DEVMGR_VFD_WriteFrequency(0);
			}
			break;
		case WORK_EXIT:
			G_WRKMGR.State = WORK_DONE;
			break;
		default:
			break;
	}
}

/*!
****************************************************************************************************
* 本地函数
****************************************************************************************************
*/
/*!
****************************************************************************************************
* 功能描述：
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：NA
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 功能描述：检查是否为主动关闭变频器
* 注意事项：NA
* 输入参数：NA
* 输出参数：NA
* 返回参数：true -- 主动关闭
*           false -- 清故障停机（可）
****************************************************************************************************
*/
bool SYSMGR_VFD_STOPFLAG(void)
{
    return G_WRKMGR.StopFlag;
}
